package homework3;

public class DopEx6 {
    /*Напишите программу вывода всех четных чисел от 2 до 100 включительно
     */

    public static void main(String[] args) {
        for (int i = 2; i <101 ; i+=2) {
            System.out.print(i+" ");
        }
    }
}
